node {
  name: "global_step/Initializer/zeros/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "global_step/Initializer/zeros/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/Initializer/zeros"
  op: "Fill"
  input: "global_step/Initializer/zeros/shape_as_tensor"
  input: "global_step/Initializer/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/dividendyield/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 66
          }
        }
        tensor_content: "\312C\200A\366\252\353?\376\010H\304I\366\325\277\001\005\217H\224\352\305?=N\007\266\335b\343\277\242+&\372-\237\266\277\0264tR\201\354\302?I\235\305E\242\036\317\277\203r\372B\0275\342\277\340\316\356q\2309\356\277\261\357F\022g\313\351?\340\316\356q\2309\356\277;\341\177\0271\233\324?\340\316\356q\2309\356\277\006r\253\370^\241\273?U\270\3224wj\350\277;`4W,\005\325\277X\341m\343j\212\322?a*\365\376\256\370\245\277w\260\316\002/\216\332?\254\260P\316?\031\347?>\313E \005\377\334\277Gd\220\353\204\202\345\277\374e\342\356\353\246\327\277\340\316\356q\2309\356\277\212,\265\220\255\257\332\277\327q\253/\352I\253\277\340\316\356q\2309\356\277\007}\031B\272\216\345\277-\311\257\276p\216\255??\372\262\017\271\201\201?\017\022\216q3\256\322\277nX\331<\360g\250?/\262\177aw\010\340\277\340\316\356q\2309\356\277gx&\363\207\313\362?\212\245\207H\227\r\321\277\325\325R\370\017\260\245?Fb\321\311p\226\315\277\232r\327\216.\357\301?\206\027w\222g\374\323\277\270\301\232\013\025%\346?}\361\3275d\262\323\277\364&\336\243?r\333\277\023\0038\372g\324\326?{N\033\rA\302\272\277Y\257\243\006\031\265\332?\247\211 tf_\266?\204\304\313E\264Q\342\277kY\276X\356!\365?\227\2014\n|\201\337\277\255_\030\304f\271\230\277|@PP\342.\370?#VZ&\241\302\273\277\3556\216k8\216\324?\373s\341\233UY\342\277gG\246\023\325~\334\277\374\233\211k\306\230\334\277\270Z\356\343\311H\250\277X\222\271\320\3059\335\277\202\243B.1\010\304\277J\220\221\326\260\214\313?\202\320n\267\317s\325\277\312\312\036wW+\337?\243\022\215\327y9\334?:\330\256\n\362W\360?\032\315\255\220\260\322\265\277"
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/dividendyield/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/dividendyield/ExpandDims"
  op: "ExpandDims"
  input: "dnn/input_from_feature_columns/input_layer/dividendyield/Const"
  input: "dnn/input_from_feature_columns/input_layer/dividendyield/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/dividendyield/ToFloat"
  op: "Cast"
  input: "dnn/input_from_feature_columns/input_layer/dividendyield/ExpandDims"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/dividendyield/Shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "B\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/dividendyield/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/dividendyield/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/dividendyield/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/dividendyield/strided_slice"
  op: "StridedSlice"
  input: "dnn/input_from_feature_columns/input_layer/dividendyield/Shape"
  input: "dnn/input_from_feature_columns/input_layer/dividendyield/strided_slice/stack"
  input: "dnn/input_from_feature_columns/input_layer/dividendyield/strided_slice/stack_1"
  input: "dnn/input_from_feature_columns/input_layer/dividendyield/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/dividendyield/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/dividendyield/Reshape/shape"
  op: "Pack"
  input: "dnn/input_from_feature_columns/input_layer/dividendyield/strided_slice"
  input: "dnn/input_from_feature_columns/input_layer/dividendyield/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/dividendyield/Reshape"
  op: "Reshape"
  input: "dnn/input_from_feature_columns/input_layer/dividendyield/ToFloat"
  input: "dnn/input_from_feature_columns/input_layer/dividendyield/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/earningsyield/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 66
          }
        }
        tensor_content: "\032\350\006_\\\310\320\277)6\204\037/\265\352\277\277\026\367\003f\230\347?\013P\265\010\234\352\355?\003U\016\354N\357\257?\372\333[$\212(\346\277\371\245\'#w\036\352\277TW\207\303\305\344\326\277\324\366V\222:\013\302\277\375\343$\314\230\245\352?\356w\366x\240 \363?\0358\002@\377_\362?\355!D\217;j\007@j\0146\256\341\005\340\277\001]BeO\371\304?\006?\360\351\232s\316\277r\313T\004X\241\310\277\200\034\220\232\031\210\274\277\204l\231\371\335v\364?hD\000\374.\265\346\277lFM\032\257\367\303\277;\026\366\345o\274\344\277\360R\251i\034-\256\277d\354\200\274\235\352\330\277l\t>\020\013\220\323\277`dzB\341^\337\277Y\361\372\t@m\352\277P\257\233S\264\333\320\277\024t\2462o\343\310\277\370X?\336\256\244\314?6\363\342\335N\t\350\277\365\2409yT\241\336?\024\256\310\006\273\266\240\277O\303S\256\240;\366?iQye\325t\340?\302\211\020\304\000h\323?F\021|\230\3159\323\277*X\022\323r\030\345?\230\335?E0E\332\277\337\367Z\211\307}\305\277\321\274\302\350\277\372\262\277\344u\034e\236?\312\277\317\027\277wj\324\352\277\271-j\343\224\326\265\277AE90D_\301?\301^\247YX?\245\277\'\2358\321\301$\360?\227\266\rO\314s\345\277VI\216<\336\206\345?:%\206\371\240\376\347\277\251\317|\007\357\313\360\277\374P\245\270X{\323?`\217\353Bn\273\354\277nW\247^\276\277\363\277M\341\311}\211\'\003@k\247l\207b\317\303\277\262&\265\257\336\245\346\277\300\315g\227\027r\301\277\212\030\260\253Z\227\321?\375\231\210\220\220\n\377?}<}\357B\033\300?\312\253;\262I\276\251\277\355>\rO|C\363?\337\323\265+\371\227\301\277\335\245\335g\261|\350?X\2736E\n\237\304?"
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/earningsyield/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/earningsyield/ExpandDims"
  op: "ExpandDims"
  input: "dnn/input_from_feature_columns/input_layer/earningsyield/Const"
  input: "dnn/input_from_feature_columns/input_layer/earningsyield/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/earningsyield/ToFloat"
  op: "Cast"
  input: "dnn/input_from_feature_columns/input_layer/earningsyield/ExpandDims"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/earningsyield/Shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "B\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/earningsyield/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/earningsyield/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/earningsyield/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/earningsyield/strided_slice"
  op: "StridedSlice"
  input: "dnn/input_from_feature_columns/input_layer/earningsyield/Shape"
  input: "dnn/input_from_feature_columns/input_layer/earningsyield/strided_slice/stack"
  input: "dnn/input_from_feature_columns/input_layer/earningsyield/strided_slice/stack_1"
  input: "dnn/input_from_feature_columns/input_layer/earningsyield/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/earningsyield/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/earningsyield/Reshape/shape"
  op: "Pack"
  input: "dnn/input_from_feature_columns/input_layer/earningsyield/strided_slice"
  input: "dnn/input_from_feature_columns/input_layer/earningsyield/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/earningsyield/Reshape"
  op: "Reshape"
  input: "dnn/input_from_feature_columns/input_layer/earningsyield/ToFloat"
  input: "dnn/input_from_feature_columns/input_layer/earningsyield/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 66
          }
        }
        tensor_content: "\350ule:M\303\277\032\025#d\217d\275\277\244\302\376\273zT\353?{\024.%cf\304\277\312\264[\275\223Kv?\332\273\3753\207\265\302\277\\&a\200Z\306\265\2774.Z*+-o?\030\223\275#`\340\275\277\036\326u\246[\222\227?\222\342&>}N\245?\020\r\217\327P\201\247?t\224V\010\334\002\351?w\202\350\255\214\247\301\2774\010<Y\023M\275\277W6)\355\'\346\276\277B\236\302\320\367u\310?\377\203\013@\237\206\300?\027H\276\3023zo?\244\370\017o{\223\266\277Dy\315\023I\271\271\277%\270\232\265\244U\254\277\234\256\225QR\243\241?s\266\256g\215\000\237?\367\261\233\014\021K\274\277\347\302\035a\003\353\303\277X\346\373Q\022\265\264\277\031q\263\027\356\275\253\277\001\204B\004\036\325\302\277`\340\213\036\221Y\317\277\230}\354\227Z\233\256\277\344+\025Ok\372\272\277\354\243\270\373\372\302\264\277\236\354Bz(L\261\277m\265\346\204\314\374\257\277Q\246\000\237\022\327\303\277\230\303S\261\362\032\263\277\263o\355\014\262\003\260\277\2673R\2241s\302\277%\007\363X\247\323\300\277i\215{Ka \275\277\020\356\034\302!\027\310\277C\355\202z\304\371\304\277\330\350\323T\277\016\223?\375HK\340\243T\304\277\365\260\273<\357\334\311\277\261\257\362\253\325(w?\351\232\025\265\271F\260\277\314\271&\265\346\235\320\277\203\340\024\261\256\205\254\277\314\305\r\353i\233\322?\227\037`I5g\275\277\032\200k}\261\357\272\277\205u\320\"\321\226\263\277\253\327\002U\376\345\312?\002\333x\315l\250\277\277\0047\200\313\021\353\262\277\366K\326\305D9\305?\002\322qMJ\340\304\277\373d\361]\022\314\263\277\343\215\347\326z\266\272\277Y\r\325\376\204\245\260\277\206%\334#R;\277\277\021\364\202&\037\201\304\277w=\020\037\233\341\275\2779\001\3419\237\342\301\277"
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/ExpandDims"
  op: "ExpandDims"
  input: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/Const"
  input: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/ToFloat"
  op: "Cast"
  input: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/ExpandDims"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/Shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "B\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/strided_slice"
  op: "StridedSlice"
  input: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/Shape"
  input: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/strided_slice/stack"
  input: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/strided_slice/stack_1"
  input: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/Reshape/shape"
  op: "Pack"
  input: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/strided_slice"
  input: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/Reshape"
  op: "Reshape"
  input: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/ToFloat"
  input: "dnn/input_from_feature_columns/input_layer/ebitdagrowth/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebit/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 66
          }
        }
        tensor_content: "_\255%\363/,\315\2772;^\030\005N\273\277\327\0041\361\223w\223\277:n\317\234\212#\321\2775\274Q\022\010\t\314\277A]\034*\206\222\301?\263\277|\221\207\217\316\277\373\234\362\206\027;\307\277\373R\262\257\213Q\322\277\375\345B\360\207\254\321\277\300\370\247T\251\253\320?\013\270\272\240\311G\321\277Z\263!\312\274F\330\277\335v\224\006\353W\262\277\357R\030}\220\031\317\277zX\024@k?\264\277\364\342\300\252\204\225\311\277y\232\216K\247\225\306\277\241w\254\n\244\007\322\277\317\016\243\313\271)\240?E*\001J\342\307\306\277eL\020\336\236\352\264\277Zs1~wQ\307\277\273\202\312\374+\204\275\277\346^*59\031\264\277pq\245\210\n\276\305\277\341\366\024k\227\343\262\277\274TJ\005\2546\260\277\267|\233u\032\267\313\277\245\264\330x\365\021\314\277\351\267\217\033\206N\232?\033\031*\276\354\312\317\277\322%>o\260\261\266\277\\\2056Q\325q\315?\246\262\262\264\004q\316\277\203\313\232r\032@\321\277N\372,\013\366t\321\277\n\270L\273\323A\310\277[>\234+*4\275\277\177\r\325\267d\312\315\277:E\346uv!\311\277m\366\016b\313\223\322\2775\035X>\345\036\251\277\367\211\216\256JO\342?\271.\246%\257(\315\277c\366u\\\240\235\327\277\331x\360\246\335~\320\277\037\370\226\017\253x\277\277\007@\267&0\251\377?Y\034\030\017\253\261\302?\362\207o6\336d\253\277\367\200\270i\236u\337?\214\003\337\230\'B\307\277\017IR\017\t\372\275\2776gI%\347X\330\277P\026\332\337z\234\317\277\005\206\010\231:\360\271?\337\252\342\210E\374\256\277\005\rrz\211e\315\277\274\313^\364\265\"\320\277\3030\213~\1777\304\277\0324\202`\367\242\316\277w\234C\217J\021\321\277*Isix\365\312\277q\356?\254\255r\272\277\215M<BH\237\315\277"
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebit/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebit/ExpandDims"
  op: "ExpandDims"
  input: "dnn/input_from_feature_columns/input_layer/evtoebit/Const"
  input: "dnn/input_from_feature_columns/input_layer/evtoebit/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebit/ToFloat"
  op: "Cast"
  input: "dnn/input_from_feature_columns/input_layer/evtoebit/ExpandDims"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebit/Shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "B\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebit/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebit/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebit/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebit/strided_slice"
  op: "StridedSlice"
  input: "dnn/input_from_feature_columns/input_layer/evtoebit/Shape"
  input: "dnn/input_from_feature_columns/input_layer/evtoebit/strided_slice/stack"
  input: "dnn/input_from_feature_columns/input_layer/evtoebit/strided_slice/stack_1"
  input: "dnn/input_from_feature_columns/input_layer/evtoebit/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebit/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebit/Reshape/shape"
  op: "Pack"
  input: "dnn/input_from_feature_columns/input_layer/evtoebit/strided_slice"
  input: "dnn/input_from_feature_columns/input_layer/evtoebit/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebit/Reshape"
  op: "Reshape"
  input: "dnn/input_from_feature_columns/input_layer/evtoebit/ToFloat"
  input: "dnn/input_from_feature_columns/input_layer/evtoebit/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebitda/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 66
          }
        }
        tensor_content: "\232\010\301\234\010\374\335\277\320\215\2474\303i\316?\367M\307\375\267o\350\277\335P\256T\363i\344\277\321\341\003/9m\320\277\262~\026$O\220\344?A\035uOy\302\326\277\005\250D\'H\240\207?\343a\370\323E\217\345\277-d\370\314\246\356\342\277\255-9\207\231g\321\277(\344\356\264\372\323\343\277\253oy\340?;\362\277k#b\344z\234\334?x\013\223\353\223o\321\277\220\355\370Z\001\375\303?\352\204#A\3362\326\277q\204\340&\177^\253\277P5\251\263W\205\345\277\272\305\326\3414\377\337?\322O^\231aC\251\277\t\231\021\016\336\305\340?\2069xP\207\273\217\277\337\010\3126\203\221\331?\373\017!\032)\005\273?\300U\021\004v\211\325\277\343M\375\313h\034\330?\222\016\246\272.\332\243?\200\351\3036\367t\323\277\2639\350v\260\010\322\277Wo\347\027\333\200\354?\235\247\354\030\276\213\357\277\377\310\221\264\211\035\323?\374\317\255\204S\312\324\277\274\240\021I\353\016\352\277\2564\354\320\314i\331\277\226\347\017\260_,\330\277v\243N\331\014\313\306\277\344\255\376\345g\272\322?\273A\037\034\327\341\304\2779\202\237\022S\013\302\277 \372\206p0 \354\277\270E/\220\200:\344?5\315\217\223\201\254\370?\275\272s\212\260\203\325\277Ne\030\037[\254\356\277\333\276\000\372\250\205\346\277y]\003\277E)\322?#\275X\244\332\211)@\255\200\311O\033\310\271\277\277\316\211\236g<\212?\315\267\3251~k\347?yD>\321.\212\222\277m\331+^y\013v?1\333\244\347\203\303\360\277O\016B\367&\223\334\277\275F\200\210\022>\312\277\233j\371\363\270z\333?\266\321U~\331~\315\277I\357\2204\036.\340\277u\371\027t\365\351\331\277\343\257\177&\366\342\323\277\351\323\2628\223}\347\277?\002\010\341\007\312\322\277Z\352\335\251\233$\340?\351\270\345c\311\245\326\277"
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebitda/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebitda/ExpandDims"
  op: "ExpandDims"
  input: "dnn/input_from_feature_columns/input_layer/evtoebitda/Const"
  input: "dnn/input_from_feature_columns/input_layer/evtoebitda/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebitda/ToFloat"
  op: "Cast"
  input: "dnn/input_from_feature_columns/input_layer/evtoebitda/ExpandDims"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebitda/Shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "B\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebitda/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebitda/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebitda/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebitda/strided_slice"
  op: "StridedSlice"
  input: "dnn/input_from_feature_columns/input_layer/evtoebitda/Shape"
  input: "dnn/input_from_feature_columns/input_layer/evtoebitda/strided_slice/stack"
  input: "dnn/input_from_feature_columns/input_layer/evtoebitda/strided_slice/stack_1"
  input: "dnn/input_from_feature_columns/input_layer/evtoebitda/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebitda/Reshape/shape/1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebitda/Reshape/shape"
  op: "Pack"
  input: "dnn/input_from_feature_columns/input_layer/evtoebitda/strided_slice"
  input: "dnn/input_from_feature_columns/input_layer/evtoebitda/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtoebitda/Reshape"
  op: "Reshape"
  input: "dnn/input_from_feature_columns/input_layer/evtoebitda/ToFloat"
  input: "dnn/input_from_feature_columns/input_layer/evtoebitda/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "dnn/input_from_feature_columns/input_layer/evtofcff/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 66
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 66
          }
        }
